# Following examples are from https://si.wikipedia.org/wiki/සිංහල_සන්ධි

import nltk

from sinling import preprocess, word_joiner

examples = [
    ('ඔවුන්', 'ඔවුන්', 'ඔවුනොවුන්', 'ස්වර සන්ධිය'),
    ('උපන්', 'උපන්', 'උපනුපන්', 'ස්වර සන්ධිය'),
    # --------------------------------------------------------------------------
    ('දකුණු', 'ඇස', 'දකුණැස', 'පූර්වස්වර (පූර්ව ස්වර) ලෝප සන්ධිය'),
    ('ගමන', 'ආගමනය', 'ගමනාගමනය', 'පූර්වස්වර (පූර්ව ස්වර) ලෝප සන්ධිය'),
    ('සුර', 'ඉඳු', 'සුරිඳු', 'පූර්වස්වර (පූර්ව ස්වර) ලෝප සන්ධිය'),
    ('නර', 'ඉඳු', 'නිරිඳු', 'පූර්වස්වර (පූර්ව ස්වර) ලෝප සන්ධිය'),
    ('යන', 'එන', 'යනෙන', 'පූර්වස්වර (පූර්ව ස්වර) ලෝප සන්ධිය'),
    ('කර්ණ', 'ආභරණ', 'කර්ණාභරණ', 'පූර්වස්වර (පූර්ව ස්වර) ලෝප සන්ධිය'),
    ('උදර', 'ආබාධ', 'උදරාබාධ', 'පූර්වස්වර (පූර්ව ස්වර) ලෝප සන්ධිය'),
    ('සිය', 'ඇසින්', 'සියැසින්', 'පූර්වස්වර (පූර්ව ස්වර) ලෝප සන්ධිය'),
    # --------------------------------------------------------------------------
    ('මුනි', 'උතුමා', 'මුනිතුමා', 'පරස්වර (පර ස්වර) ලෝප සන්ධිය'),
    ('ගුරු', 'උතුමා', 'ගුරුතුමා', 'පරස්වර (පර ස්වර) ලෝප සන්ධිය'),
    # --------------------------------------------------------------------------
    ('මහ', 'ඉසුරු', 'මහෙසුරු', 'ස්වරාදේශ (ස්වර ආදේශ ) සන්ධිය'),
    ('වට', 'උර', 'වටොර', 'ස්වරාදේශ (ස්වර ආදේශ ) සන්ධිය'),
    ('සහ', 'උදර', 'සහෝදර', 'ස්වරාදේශ (ස්වර ආදේශ ) සන්ධිය'),
    # --------------------------------------------------------------------------
    ('ගඟ', 'වතුර', 'ගoවතුර', 'ගාත්‍රාක්‍ෂර (ගාත්‍රා අක්‍ෂර) ලෝප සන්ධිය'),
    ('කොළඹ', 'තොට', 'කොළොම්තොට', 'ගාත්‍රාක්‍ෂර (ගාත්‍රා අක්‍ෂර) ලෝප සන්ධිය'),
    # --------------------------------------------------------------------------
    ('ගිනි', 'කම්', 'ගිනියම්', 'ගාත්‍රාදේශ (ගාත්‍ර ආදේශ) සන්ධිය'),
    ('කබ්', 'පිල', 'කප්පිල', 'ගාත්‍රාදේශ (ගාත්‍ර ආදේශ) සන්ධිය'),
    ('බුද්', 'සරණ', 'බුත්සරණ', 'ගාත්‍රාදේශ (ගාත්‍ර ආදේශ) සන්ධිය'),
    # --------------------------------------------------------------------------
    ('වත්', 'කම්', 'වත්තම්', 'පූර්වරූප (පූර්ව රූප) සන්ධිය'),
    ('අත්', 'කම්', 'අත්තම්', 'පූර්වරූප (පූර්ව රූප) සන්ධිය'),
    # --------------------------------------------------------------------------
    ('අත්', 'සන', 'අස්සන', 'පරරූප (පර රූප) සන්ධිය'),
    ('ලක්', 'ගල', 'ලග්ගල', 'පරරූප (පර රූප) සන්ධිය'),
    # --------------------------------------------------------------------------
    ('වැදි', 'ආ', 'වැද්දා', 'ද්විත්වරූප (ද්විත්ව රූප ) සන්ධිය'),
    # --------------------------------------------------------------------------
    ('පිරි', 'අත්', 'පිරියත්', 'ආගම සන්ධිය'),
    ('දැන්', 'දු', 'දැනුදු', 'ආගම සන්ධිය'),
]

examples2 = [
    ('කොක්', 'ආ', 'කොකා', '?'),
    ('හරක්', 'එක්', 'හරකෙක්', '?'),
    ('තරු', 'අ', 'තරුව', '?'),
    ('ගිරා', 'එක්', 'ගිරවෙක්', '?'),
    ('ගිරා', 'ආ', 'ගිරවා', '?'),
    ('කොර', 'ආ', 'කොරා', '?'),
    ('පාලම්', 'අ', 'පාලම', '?'),
    ('හිත්', 'අ', 'හිත', '?'),
    ('මල්', 'අ', 'මල', '?'),
    ('මලු', 'අ', 'මල්ල', '?'),
    ('මල්', 'අක්', 'මලක්', '?'),
    ('මලු', 'අක්', 'මල්ලක්', '?'),
    ('ගිරා', 'උ', 'ගිරවු', '?'),
    ('තරු', 'අක්', 'තරුවක්', '?'),
    ('තරු', 'අක', 'තරුවක', '?'),
    ('හිත්', 'ඒ', 'හිතේ', '?'),
    ('ජාතික', 'යා', 'ජාතිකයා', '?'),
    ('කඳවුරු', 'අ', 'කඳවුර', '?'),
    ('වරාය', 'අක්', 'වරායක්', '?'),
    ('යානා', 'අ', 'යානාව', '?'),
    ('මිනිස්', 'ආ', 'මිනිසා', '?'),
    ('ඇත්', 'එක්', 'ඇතෙක්', '?'),
]


def reader(file):
    with open(file, 'r', encoding='utf-8') as f1:
        for item in f1.read().split('\n'):
            yield item.split(' ')


if __name__ == '__main__':
    true_positive = 0
    false_positive = 0
    words = [w for r in reader('../data/tokenized.txt') for w in r]
    dist = nltk.FreqDist(words)
    for w1, w2, r1, c in examples2:
        if c != '':
            w1, w2 = preprocess(w1), preprocess(w2)
            max_count = -1
            word = '?'
            for r2 in word_joiner.join(w1, w2):
                count = dist[r2]
                if count > max_count:
                    word = r2
                    max_count = count
            if r1 == word:
                print(w1, w2, r1, word, 1)
                true_positive += 1
            else:
                print(w1, w2, r1, word, 0)
                false_positive += 1
    print('True Positives {}'.format(true_positive))
    print('False Positives {}'.format(false_positive))
